dataHandler(
{
  "libraries": [
    {
      "name": "AngularJS",
      "developers": "Google Inc. and community",
      "description": "AngularJS assists with running single-page applications. Its goal is to augment browser-based applications with model–view–controller (MVC) capability, in an effort to make both development and testing easier. The library reads in HTML that contains additional custom tag attributes; it then obeys the directives in those custom attributes, and binds input or output parts of the page to a model represented by standard JavaScript variables. The values of those JavaScript variables can be manually set, or retrieved from static or dynamic JSON resources.."
    },
    {
      "name": "jQuery",
      "developers": "John Resig, jQuery Team",
      "description": "jQuery is a cross-platform JavaScript library designed to simplify the client-side scripting of HTML.[2] It was released in January 2006 at BarCamp NYC by John Resig. It is currently developed by a team of developers led by Dave Methvin. Used by over 65% of the 10,000 most visited websites, jQuery is the most popular JavaScript library in use today. jQuery's syntax is designed to make it easier to navigate a document, select DOM elements, create animations, handle events, and develop Ajax applications. jQuery also provides capabilities for developers to create plug-ins on top of the JavaScript library. This enables developers to create abstractions for low-level interaction and animation, advanced effects and high-level, theme-able widgets. The modular approach to the jQuery library allows the creation of powerful dynamic web pages and web applications."
    },
    {
      "name": "Node.js",
      "developers": "Ryan Lienhart Dahl, Node.js Developers, Joyent",
      "description": "Node.js is a software platform that is used to build scalable network (especially server-side) applications. Node.js utilizes JavaScript as its scripting language, and achieves high throughput via non-blocking I/O and a single-threaded event loop. Node.js contains a built-in HTTP server library, making it possible to run a web server without the use of external software, such as Apache or Lighttpd, and allowing more control of how the web server works."
    },
    {
      "name": "Bootstrap",
      "developers": "Mark Otto and Jacob Thornton",
      "description": "Bootstrap is a free collection of tools for creating websites and web applications. It contains HTML and CSS-based design templates for typography, forms, buttons, navigation and other interface components, as well as optional JavaScript extensions. It is the most popular project on GitHub[2] and has been used by NASA and MSNBC among others."
    },
    {
      "name": "Mustache.js",
      "developers": "Community",
      "description": "Mustache is a simple web template system with implementations available for ActionScript, C++, Clojure, CoffeeScript, ColdFusion, D, Erlang, Fantom, Go, Java, JavaScript, Lua, .NET, Objective-C, Perl, PHP, Python, Ruby, Scala and XQuery. Mustache is described as a \"logic-less\" system because it lacks any explicit control flow statements, like if and else conditionals or for loops; however, both looping and conditional evaluation can be achieved using section tags processing lists and lambdas. It is named \"Mustache\" because of heavy use of curly braces that resemble a mustache. Mustache is used mainly for mobile and web  applications."
    },
    {
      "name": "jQuery Mobile",
      "developers": "The jQuery Project",
      "description": "jQuery Mobile is a touch-optimized web framework (additionally known as a JavaScript library or a mobile framework) currently being developed by the jQuery project team. The development focuses on creating a framework compatible with a wide variety of smartphones and tablet computers,[3] made necessary by the growing but heterogeneous tablet and smartphone market.[4] The jQuery Mobile framework is compatible with other mobile app frameworks and platforms such as PhoneGap, Worklight[5] and more."
    },
    {
      "name": "KnockoutJS",
      "developers": "Steve Sanderson",
      "description": "Knockout is a standalone JavaScript implementation of the Model-View-ViewModel pattern with templates. The underlying principles are therefore: a clear separation between domain data, view components and data to be displayed the presence of a clearly defined layer of specialized code to manage the relationships between the view components.The latter leverages the native event management features of the JavaScript language. These features streamline and simplify the specification of complex relationships between view components, which in turn make the display more responsive and the user experience richer."
    },
    {
      "name": "Backbone.js",
      "developers": "Jeremy Ashkenas",
      "description": "Backbone.js is a JavaScript library with a RESTful JSON interface and is based on the model–view–presenter (MVP) application design paradigm. Backbone is known for being lightweight, as its only dependency is on one JavaScript library,[2] Underscore.js. It is designed for developing single-page web applications,[3] and for keeping various parts of web applications (e.g. multiple clients and the server) synchronized.[4] Backbone was created by Jeremy Ashkenas, who is also known for CoffeeScript.[5]"
    },
    {
      "name": "D3.js",
      "developers": "Michael Bostock, Jeffrey Heer, Vadim Ogievetsky, and community",
      "description": "D3.js (or just D3 for Data-Driven Documents) is a JavaScript library that uses digital data to drive the creation and control of dynamic and interactive graphical forms which run in web browsers. It is a tool for data visualization in W3C-compliant computing, making use of the widely implemented Scalable Vector Graphics (SVG), JavaScript, HTML5, and Cascading Style Sheets (CSS3) standards. It is the successor to the earlier Protovis framework.[1] In contrast to many other libraries, D3 allows great control over the final visual result.[2] Its development was noted in 2011,[3] as version 2.0.0 was released in August 2011.[4] As of November 2013, the library is at version 3.3.11.[5]"
    }
  ]
});